# 코드에 대한 설명을 작성합니다.
# 컴퓨터에게 시키고 싶은 여러개의 일을
# 파일에 모두 기록하고 저장하는 형태 ==> 스크립트 파일이라고함!
# XXX.py
# 컴퓨터 모니터에 데이터를 출력하는 기능 코드
print(10)
print(2024)
print(1126)

# 그냥 데이터 코드 작성
# 컴퓨터 메모리에 저장
10

# 컴퓨터 메모리에 저장하고 저장정보를 저장함!
# 문법
# [1] 100을 메모리에 저장
# [2] 100이 저장된 메모리 위치를 가져와서 스택 메모리에 저장
# [3] 100이 저장된 정보를 저장하고 있는 스택 메모리에 이름을 붙임 => 변수
num = 100
year = 2025

# 메모리에 저장된 데이터를 화면에 출력하기
print( year )
print( num )

# 메모리에 데이터 저장하고 데이터 주소 저장하는 변수
# 나이저장
age =  10
Age = 11
print (age, Age)

# 학년저장
grade1 = 1
_grade = 5
grade_1 = 1

# 파이썬 문법에서 사용되는 단어는 변수명(데이터이름) X
# with = 10

# 이름을 저장하기 ==> 글차 데이터 저장 시 '', " " 기입
name = " 홍길동 "
gender = " 남자 "
schoolnumber =' 1 '

print ( name )
print ( gender )
